In [2]:
import pandas as pd
import numpy as np

In [2]:
pd

In [3]:
np

In [5]:
df = pd.DataFrame(np.random.randint(0, 50, (3, 4)))

In [6]:
df

    0   1   2   3
0   7  30  41  11
1   8  14  22  45
2  49  45  45  44

In [7]:
df.rename(columns={'0':'asd'})

    0   1   2   3
0   7  30  41  11
1   8  14  22  45
2  49  45  45  44

In [8]:
df

    0   1   2   3
0   7  30  41  11
1   8  14  22  45
2  49  45  45  44

In [23]:
dd = df.rename(columns={0:'asd', 1:'sdf', 2:'jih', 3:'gbcvbv'},
         index={0:'qwew',1:'uhyg', 2:'bvchgad'})

In [13]:
df

    0   1   2   3
0   7  30  41  11
1   8  14  22  45
2  49  45  45  44

In [14]:
df.index=['ad', 'fg', 'zxcz']

In [16]:
df.columns=['ad', 'fg', 'zxcz', 'veter']

In [17]:
df

      ad  fg  zxcz  veter
ad     7  30    41     11
fg     8  14    22     45
zxcz  49  45    45     44

In [18]:
df.index=range(3)

In [21]:
df.columns=range(4)

In [22]:
df

    0   1   2   3
0   7  30  41  11
1   8  14  22  45
2  49  45  45  44

In [58]:
dd

NameError: name 'dd' is not defined

In [27]:
dd.loc[:,'asd']

qwew        7
uhyg        8
bvchgad    49
Name: asd, dtype: int32

In [28]:
df

    0   1   2   3
0   7  30  41  11
1   8  14  22  45
2  49  45  45  44

In [29]:
df.index=list('ABC')

In [30]:
df.columns=list('abcd')

In [31]:
df

    a   b   c   d
A   7  30  41  11
B   8  14  22  45
C  49  45  45  44

### 增加一列数据

In [33]:
df['e'] = np.random.randint(0, 50, 3)

In [34]:
df

    a   b   c   d   e
A   7  30  41  11  42
B   8  14  22  45  40
C  49  45  45  44  43

### 增加一行数据

In [37]:
df.loc['D'] = np.random.randint(0, 50, 5)

In [38]:
df

    a   b   c   d   e
A   7  30  41  11  42
B   8  14  22  45  40
C  49  45  45  44  43
D   8  37  42  42  42

### 增加一列为各列数据之和

In [45]:
df =df.drop('f',axis=1)

In [46]:
df

    a   b   c   d   e
A   7  30  41  11  42
B   8  14  22  45  40
C  49  45  45  44  43
D   8  37  42  42  42

In [47]:
df['f'] = df.sum(axis=1)

In [48]:
df

    a   b   c   d   e    f
A   7  30  41  11  42  131
B   8  14  22  45  40  129
C  49  45  45  44  43  226
D   8  37  42  42  42  171

In [49]:
df.drop(['c','d'], axis=1)

    a   b   e    f
A   7  30  42  131
B   8  14  40  129
C  49  45  43  226
D   8  37  42  171

In [50]:
del df['e']

In [59]:
df

    a   b   c   d    f
A   7  30  41  11  131
B   8  14  22  45  129
C  49  45  45  44  226
D   8  37  42  42  171

In [62]:
df.drop(['f'], axis=1, inplace=True)

In [63]:
df

    a   b
A   7  30
B   8  14
C  49  45
D   8  37

In [66]:
df = pd.DataFrame(np.random.randint(0, 50, (3, 4)))
df.index = list('ABC')
df.columns=list('abcd')

In [67]:
df

    a   b   c   d
A   5  25  48  37
B  43  10  26  31
C  33  32  11  25

In [68]:
df['g'] = [np.nan, 2, 9]

In [69]:
df

    a   b   c   d    g
A   5  25  48  37  NaN
B  43  10  26  31  2.0
C  33  32  11  25  9.0

In [70]:
df.isnull()

       a      b      c      d      g
A  False  False  False  False   True
B  False  False  False  False  False
C  False  False  False  False  False

In [71]:
df[df.isnull()] = 45

In [72]:
df

    a   b   c   d     g
A   5  25  48  37  45.0
B  43  10  26  31   2.0
C  33  32  11  25   9.0

In [75]:
df['g'] = df['g'].astype(np.int)

In [76]:
df

    a   b   c   d   g
A   5  25  48  37  45
B  43  10  26  31   2
C  33  32  11  25   9

In [77]:
df.T

    A   B   C
a   5  43  33
b  25  10  32
c  48  26  11
d  37  31  25
g  45   2   9

In [78]:
df

    a   b   c   d   g
A   5  25  48  37  45
B  43  10  26  31   2
C  33  32  11  25   9

In [79]:
df.index

Index(['A', 'B', 'C'], dtype='object')

In [81]:
df.index.tolist()

['A', 'B', 'C']

In [86]:
np.array(df.index)

array(['A', 'B', 'C'], dtype=object)

In [88]:
pd.Series(df.index)

0    A
1    B
2    C
dtype: object

In [95]:
s1 = pd.Series(range(1, 6), index=list('abcde'))
s2 = pd.Series([10,20,30,40,50], index=list('cdefg'))

In [96]:
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [97]:
s2

c    10
d    20
e    30
f    40
g    50
dtype: int64

In [98]:
s1.add(s2)

a     NaN
b     NaN
c    13.0
d    24.0
e    35.0
f     NaN
g     NaN
dtype: float64

In [100]:
s1.add(s2, fill_value=100)

a    101.0
b    102.0
c     13.0
d     24.0
e     35.0
f    140.0
g    150.0
dtype: float64

In [101]:
d1 = pd.DataFrame(np.random.randint(0, 50, (3,3)))
d2 = pd.DataFrame(np.random.randint(0, 50, (3,3)))

In [102]:
d1

    0   1   2
0  29  39   8
1  24  26  22
2  18  46  40

In [103]:
d2

    0   1   2
0  32  17  33
1  49   2  27
2  11  42  14

In [115]:
d2 = d2.drop(3, axis=1)

In [116]:
d2

    0   1   2
0  32  17  33
1  49   2  27
2  11  42  14

In [117]:
d1.add(d2)

    0   1   2
0  61  56  41
1  73  28  49
2  29  88  54

In [118]:
d2[3] = d2[2]+5

In [119]:
d2

    0   1   2   3
0  32  17  33  38
1  49   2  27  32
2  11  42  14  19

In [120]:
d1.add(d2, fill_value=100)

    0   1   2      3
0  61  56  41  138.0
1  73  28  49  132.0
2  29  88  54  119.0

In [121]:
d2 = d2.drop(3, axis=1)

In [122]:
d2

    0   1   2
0  32  17  33
1  49   2  27
2  11  42  14

In [125]:
pd.concat([d1, d2], axis=0, ignore_index=True)

    0   1   2
0  29  39   8
1  24  26  22
2  18  46  40
3  32  17  33
4  49   2  27
5  11  42  14

In [127]:
df1 = pd.DataFrame([np.random.randint(0, 50, 4), [1.1,1.2,1.3]])
df1

      0     1     2     3
0  11.0  35.0  29.0  48.0
1   1.1   1.2   1.3   NaN

In [129]:
df1.isnull()

       0      1      2      3
0  False  False  False  False
1  False  False  False   True

In [130]:
df1.notnull()

      0     1     2      3
0  True  True  True   True
1  True  True  True  False

In [149]:
df1 = df1.append(pd.Series([1.1,np.nan,1.2,1.3]), ignore_index=True)

In [150]:
df1

      0     1     2     3
0  11.0  35.0  29.0  48.0
1   1.1   1.2   1.3   NaN
2   1.1   NaN   1.2   1.3

In [153]:
df1.fillna({1:0, 3:100})

      0     1     2      3
0  11.0  35.0  29.0   48.0
1   1.1   1.2   1.3  100.0
2   1.1   0.0   1.2    1.3

In [155]:
df1 = pd.DataFrame(np.random.randint(0, 50, (3,3)), columns=list('abc'))
df1

    a   b   c
0  17  23  24
1  49  18  15
2  20  44  27

In [159]:
df1 = df1.append(pd.Series([49, 18, 15], index=list('abc')), ignore_index=True)

In [171]:
df1 = df1.drop(3,axis=0)

In [174]:
df1.index=range(4)
df1

      a     b     c
0  17.0  23.0  24.0
1  49.0  18.0  15.0
2  20.0  44.0  27.0
3  49.0  18.0  15.0

In [176]:
df1.duplicated('a')

0    False
1    False
2    False
3     True
dtype: bool

In [178]:
df1.drop_duplicates('a')

      a     b     c
0  17.0  23.0  24.0
1  49.0  18.0  15.0
2  20.0  44.0  27.0

In [182]:
df = pd.DataFrame({'A': [0, 1, 5, 3, 4],
        'B': [5, 6, 7, 8, 9],
        'C': ['a', 'b', 'c', 'd', 'e']})

In [183]:
df

   A  B  C
0  0  5  a
1  1  6  b
2  5  7  c
3  3  8  d
4  4  9  e

In [187]:
df.replace(['a', 'b'], 1)

   A  B  C
0  0  5  1
1  1  6  1
2  5  7  c
3  3  8  d
4  4  9  e

In [185]:
df

   A  B  C
0  0  5  a
1  1  6  b
2  5  7  c
3  3  8  d
4  4  9  e

In [188]:
s1 = pd.Series(np.random.randint(-10, 10, 5))

In [189]:
s1

0    5
1   -7
2    8
3    4
4   -2
dtype: int32

In [197]:
np.sum(s1)

8

In [190]:
s1.abs()
# 或 np.abs(s1)

0    5
1    7
2    8
3    4
4    2
dtype: int32

In [199]:
d = pd.DataFrame(np.random.randint(-50, 50, (3,3)), columns=list('abc'))

In [200]:
d

    a   b   c
0 -23  44  35
1 -28 -47  23
2  -4  15 -44

In [202]:
# 按行计算
np.sum(d, axis=1)

0    56
1   -52
2   -33
dtype: int64

In [194]:
np.abs(d)

    0   1   2
0   3  29  34
1  15  35   2
2  21  44  20

In [198]:
np.sum(d)

0     3
1   -38
2    16
dtype: int64

In [3]:
dfd1 = pd.DataFrame(np.random.randint(0, 50, (3,3)), columns=list('abc'))
dfd2 = pd.DataFrame(np.random.randint(0, 50, (3,3)), columns=list('bcd'))

In [4]:
dfd1

    a   b   c
0  39   7  23
1   4  24  45
2  43  36   5

In [5]:
dfd2

    b   c   d
0   3  13  47
1  36  36  38
2  35  38  43

### join = 'inner'：只保留相同的索引
### ignore_index=True：重新建立行索引

In [6]:
pd.concat([dfd1, dfd2], ignore_index=True, join='inner')

    b   c
0   7  23
1  24  45
2  36   5
3   3  13
4  36  36
5  35  38